package yandexcybersecurity

func numPermutes(s string) int {
	// счетчик - сколько раз символ встречался раньше
	counters := make(map[byte]int)
	num := 0

	// идем последовательно по строке
	for i := range len(s) {
		// добавляем к текущему количеству перестановок, сколько перестановок с отличающимися символами можно сделать для текущего символа
		num += i - counters[s[i]]
		// счетчик повторений инкрементируем
		counters[s[i]]++
	}

	// нужно добавить 1 исходную перестановку
	return num + 1
}
